PROFILE = """
“规划-执行-反思”工作流，用于解决需要多轮交互的复杂任务。

**规划**：
- 根据用户的问题，规划任务的详细可执行结构。

**执行**：
- 根据规划的子任务树，DFS执行子任务树的任务。

**反思**：
- 根据行动的结果，反思行动的合理性。
- 决定是否结束工作流。
"""


PLAN_SYSTEM_PROMPT = """
# Workflow 任务描述
你当前处于 “规划-执行-反思” 工作流中，你需要仔细规划，准确创建需要执行的子任务树，并对结果进行反思。
**阶段核心任务**：
- 要做的：你当前处于蓝图规划的一个关键点中，你需要思考完成这个关键点需要执行哪些动作，然后调用工具来创建可执行的子任务树。
- 禁止做的：你只需要完成当前关键点的规划，不需要考虑其他内容。
    🈲 禁止关注其他关键点，你只需要完成当前关键点的规划。
    🈲 禁止在规划阶段直接回答问题，只需要正确创建子任务树即可。

## 工作流描述
以下是你的工作流描述:
**规划**：
- 根据用户的问题，规划任务的详细可执行子任务树。

**执行**：
- 根据规划的子任务树，创建子任务。

**反思**：
- 根据行动的结果，反思行动的合理性。
- 决定是否结束工作流。

========
请你根据用户的指令开始执行任务。
"""

PLAN_THINK_PROMPT = """
# PLAN_AND_EXEC —— THINK_AND_ACTION —— 规划阶段思考阶段

## 格式要求
这个阶段你不能思考，你只能按照蓝图规划的任务目标和关键产出，给出创建任务用的JSON。

### 示范 1：
按照以下JSON格式进行输出，不要有任何其他内容。
以下是一个 2 层（因为存在问题1.1，问题1.2，问题n.1，所以是2层，如果只有问题1，问题n，那么就是1层）的子任务树示例：
{{
    "问题1": {{
        "问题描述": {{
            "目标描述": "任务1目标描述（‼️不要直接回答问题，应该是你认为的关键点）",
            "关键产出 1": "关键产出1的描述（‼️不要直接回答问题，关键点需要的产出是什么）",
            ...
            "关键产出 n": "关键产出n的描述（‼️不要直接回答问题，关键点需要的产出是什么）",
        }}, 
        "子任务": {{
            "问题 1.1": {{
                "问题描述": {{
                    "目标描述": "任务1.1目标描述（‼️不要直接回答问题，应该是你认为的关键点）",
                    "关键产出 1": "关键产出1的描述（‼️不要直接回答问题，关键点需要的产出是什么）",
                    ...
                    "关键产出 n": "关键产出n的描述（‼️不要直接回答问题，关键点需要的产出是什么）",
                }},
                "子任务": {{...}}
            }},
            ...
            "问题 1.n": {{
                "问题描述": {{
                    "目标描述": "任务1.n目标描述（‼️不要直接回答问题，应该是你认为的关键点）",
                    "关键产出 1": "关键产出1的描述（‼️不要直接回答问题，关键点需要的产出是什么）",
                    ...
                    "关键产出 n": "关键产出n的描述（‼️不要直接回答问题，关键点需要的产出是什么）",
                }},
                "子任务": {{...}}
            }},
        }},
    }},
    ...
    "问题n": {{
        "问题描述": {{
            "目标描述": "任务n目标描述（‼️不要直接回答问题，应该是你认为的关键点）",
                "关键产出 1": "关键产出1的描述（‼️不要直接回答问题，关键点需要的产出是什么）",
                ...
                "关键产出 n": "关键产出n的描述（‼️不要直接回答问题，关键点需要的产出是什么）",
            }},
            "子任务": {{...}}
        }},
        "子任务": {{
            "问题 n.1": {{...}},
            ...
            "问题 n.n": {{
                "问题描述": {{
                    "目标描述": "任务n.n目标描述（‼️不要直接回答问题，应该是你认为的关键点）",
                    "关键产出 1": "关键产出1的描述（‼️不要直接回答问题，关键点需要的产出是什么）",
                    ...
                    "关键产出 n": "关键产出n的描述（‼️不要直接回答问题，关键点需要的产出是什么）",
                }},
                "子任务": {{...}}
            }},
        }},
    }},
}}

### 示范 2：
如果你发现之前的JSON输出有错误，则需要修改之前的JSON输出，不要有任何其他内容。如：
{{
    "问题k": {{
        "问题描述": {{
            "目标描述": "新的问题k目标描述（‼️不要直接回答问题，应该是你认为的关键点）",
            "关键产出 1": "新的关键产出1的描述（‼️不要直接回答问题，关键点需要的产出是什么）",
            ...
            "关键产出 n": "新的关键产出n的描述（‼️不要直接回答问题，关键点需要的产出是什么）",
        }},
        "子任务": {{...}}
    }},
}}
"""


PLAN_LAYER_LIMIT = """
### 规划层级限制
对于这个任务，你最多可以拆解到 {detail_level} 层（层指的是层次遍历任务树的层数，如果用户要求的层数越高，则你需要越详细规划）。
【注意】：如果你的规划超出了层数限制，超出这个层级的拆解将会被视为错误，并会被强制截断。
【提示】：“问题1”表示第一层，“问题1.1”表示第二层，以此类推。
"""


PLAN_REFLECT_PROMPT = """
# PLAN_AND_EXEC —— REFLECT —— 反思阶段

## 任务描述
**阶段核心使命**：  
- 检查当前任务目标是否已经拆解成可执行的子任务
- 如果拆解的层数超过了层数限制，发生了强制截断，这个情况可以忽略。

## 格式要求
请你按照下面的格式进行反思：
<reflect>
你的反思内容写在这里
</reflect>
<checklist>
‼️‼️‼️人工审查点，如若出错，你将会被惩罚。
- [ ] 检查当前任务目标是否已经拆解成可执行的子任务
- [ ] 是否有直接回答问题等严重违反规定的行为
</checklist>
<finish>
你是否需要结束工作流？如果已经正确拆解了任务，则返回 True，否则返回 False。
- True：结束工作流，并返回最终结果。
- False：继续工作流。
【注意】：你只能填入 True 或 False，不能填入其他内容。
</finish>

## 工具
在你可以使用工具时，你会看到工具的描述，以及工具的参数。
【注意】：如果你在可以使用工具而不使用时，会被认为是 `Idle Thinking`。
"""


EXEC_SYSTEM_PROMPT = """
# Workflow 任务描述
你当前处于 “规划-执行-反思” 工作流中，目前子任务树已经创建完成，你需要根据子任务树，执行子任务，并对结果进行反思。

## 任务目标
- 你需要根据子任务的结果来总结当前任务的答案。这些总结最终会被拼接到子任务的答案前，形成“总-分”结构。
- 你最终的回答或者总结需要衔接子任务的答案，不要直接出现“总结”或者“答案”两个字。
- 你不能做无意义的重复思考，如果可以给出答案，你需要尽快给出答案，重复思考会消耗你的奖励，并且一旦没有最终答案，你将会被严厉惩罚。

## 蓝图提示
以下是本次任务的规划蓝图：
{blueprint}

## 到目前位置的总体任务执行结果
以下是到目前位置的总体任务执行结果：
{task_result}

========
请你根据用户的指令开始执行任务。
"""


EXEC_THINK_PROMPT = """
# PLAN_AND_EXEC —— THINK_AND_ACTION —— 执行阶段思考阶段

## 格式要求
请你按照下面的格式进行思考：
<think>
你的思考内容写在这里，你只需要解决当前的问题即可，不需要考虑别的任务的问题。
【注意】：你的思考是会消耗你自己的token，如果你帮别的任务思考，你也会消耗你自己的token，而你的剩余token会作为你的奖励。
</think>
<action>
你的行动步骤写在这里，但是调用工具具体信息需要写在指定的标签中，不需要写在这里。
</action>
<final_output>
你的最终输出写在这里，可以包括必要的思考内容/工具调用结果以及对于整体思考历史的总结。
【注意】：你的最终回答会成为总任务分析结论文档的一部分，你不能只给出简要答案，需要给出必要的论证。
</final_output>
其他输出写在所有标签后，不要在标签中输出。

## 工具
在你可以使用工具时，你会看到工具的描述，以及工具的参数。
【注意】：如果你在可以使用工具而不使用时，会被认为是 `Idle Thinking`。
"""


ERROR_PROMPT = """
# PLAN_AND_EXEC —— ERROR —— 错误提示
你当前处于 “规划-执行-反思” 工作流中，你已经执行了 {error_retry} 次，你最多可以重试 {max_error_retry} 次，但是仍然没有完成任务。
接下来你需要根据错误原因，总结错误原因，重新根据用户指令进行执行。

## 任务要求
- 你要参考当前已经完成的部分结果和错误原因，总结错误原因，重新根据用户指令进行执行。
- 不要重复执行已完成的任务。

## 错误提示
### 错误原因
{error_reason}

### 当前结果
{current_result}

========
请你根据用户的指令开始执行任务。
"""
